{"title": "Rocket Propulsion Elements", "author": "George P. Sutton", "pages": [{"chapter": "Chapter 1", "page": 1, "body": "CLASSIFICATION\nThe word propulsion comes from the Latin propulsus, which is the past participle\nof the verb propellere, meaning to drive away. In a broad sense propulsion is the\nact of changing the motion of a body. Propulsion mechanisms provide a force\nthat moves bodies that are initially at rest, changes a velocity, or overcomes\nretarding forces when a body is propelled through a medium. Jet propulsion is\na means of locomotion whereby a reaction force is imparted to a device by the\nmomentum of ejected matter.\nRocket propulsion is a class of jet propulsion that produces thrust by ejecting\nmatter stored in a ﬂying vehicle called the propellant. Duct propulsion is a class\nof jet propulsion and includes turbojets and ramjets; these engines are also com-\nmonly called air-breathing engines. Duct propulsion devices utilize mostly the\nsurrounding medium as the “working ﬂuid,” together with some vehicle-stored\nfuel. Combinations of rockets and duct propulsion devices can be attractive for\nsome narrow applications and one is brieﬂy described in this chapter.\nThe energy source most useful to rocket propulsion is chemical combustion.\nEnergy can also be supplied by solar radiation and, in the past, also by nuclear\nreaction. Accordingly, the various propulsion devices can be divided into chem-\nical propulsion, nuclear propulsion, and solar propulsion. Table 1–1 lists many\nof the important propulsion concepts according to their energy source and type\nof propellant or working ﬂuid. Radiation energy can originate from sources other\nthan the sun and theoretically can cover the transmission of energy by microwave\nand laser beams, electromagnetic waves, and electrons, protons, and other par-\nticle beams from a transmitter to a ﬂying receiver. Nuclear energy is associated\nwith the transformations of atomic particles within the nucleus of atoms and\nusually is created by ﬁssion or fusion. Other energy sources, both internal (in the\nvehicle) and external, can be considered. The energy form found in the output\n1"}, {"chapter": "Chapter 1", "page": 2, "body": "TABLE 1–1. Energy Sources and Propellants for Various Propulsion Concepts\nEnergy Sourcea\nPropulsion Device\nChemical\nNuclear\nSolar\nPropellant or Working Fluid\nTurbojet\nD/P\nTFD\nFuel + air\nTurbo–ramjet\nTFD\nFuel + air\nRamjet (hydrocarbon fuel)\nD/P\nTFD\nFuel + air\nRamjet (H2 cooled)\nTFD\nHydrogen + air\nRocket (chemical)\nD/P\nTFD\nStored propellant\nDucted rocket\nTFD\nStored solid fuel +\nsurrounding air\nElectric rocket\nD/P\nTFD\nD/P\nStored propellant\nNuclear ﬁssion rocket\nTFD\nStored H2\nNuclear fusion rocket\nTFND\nStored H2\nSolar-heated rocket\nTFD\nStored H2\nPhoton rocket (big light\nbulb)\nTFND\nPhoton ejection (no stored\npropellant)\nSolar sail\nTFD\nPhoton reﬂection (no stored\npropellant)\naD/P, developed and/or considered practical; TFD, technical feasibility has been demonstrated, but\ndevelopment is incomplete; TFND, technical feasibility has not yet been demonstrated.\nof a rocket is largely the kinetic energy of the ejected matter; thus the rocket\nconverts the input from the energy source into this form. The ejected mass can\nbe in a solid, liquid, or gaseous state. Often a combination of two or more of\nthese is ejected. At very high temperatures it can also be a plasma, which is an\nelectrically activated gas.\n1.1. DUCT JET PROPULSION\nThis class, also called air-breathing engines, comprises devices which have a duct\nto conﬁne the ﬂow of air. They use oxygen from the air to burn fuel stored in\nthe ﬂight vehicle. The class includes turbojets, turbofans, ramjets, and pulsejets.\nThis class of propulsion is mentioned primarily to provide a comparison with\nrocket propulsion and a background for combination rocket–duct engines, which\nare mentioned later. Table 1–2 compares several performance characteristics\nof speciﬁc chemical rockets with those of typical turbojets and ramjets. A high\nspeciﬁc impulse, which is a measure of performance to be deﬁned later, is directly\nrelated to a long ﬂight range and thus indicates the superior range capability of air\nbreather engines over chemical rockets at relatively low altitude. The uniqueness\nof the rocket, for example, high thrust to weight, high thrust to frontal area, and\nnearly thrust independence of altitude, enables extremely long ﬂight ranges to be\nobtained in rareﬁed air and in space.\nThe turbojet engine is the most common of ducted engines. Figure 1–1 shows\nthe basic elements."}, {"chapter": "Chapter 1", "page": 3, "body": "\nTABLE 1–2. Comparison of Several Characteristics of a Typical Chemical Rocket and\nTwo-Duct Propulsion Systems\nChemical\nRocket Engine\nor Rocket\nFeature\nMotor\nTurbojet Engine\nRamjet Engine\nThrust-to-weight ratio,\ntypical\n75:1\n5:1, turbojet and\nafterburner\n7:1 at Mach 3 at\n30,000 ft\nSpeciﬁc fuel consumption\n(pounds of propellant or\nfuel per hour per pound\nof thrust)a\n8–14\n0.5–1.5\n2.3–3.5\nSpeciﬁc thrust (pounds of\nthrust per square foot\nfrontal area)b\n5000–25,000\n2500 (low Mach at\nsea level)\n2700 (Mach 2 at sea\nlevel)\nThrust change with altitude\nSlight increase\nDecreases\nDecreases\nThrust vs. ﬂight speed\nNearly constant Increases with\nspeed\nIncreases with speed\nThrust vs. air temperature\nConstant\nDecreases with\ntemperature\nDecreases with\ntemperature\nFlight speed vs. exhaust\nvelocity\nUnrelated,\nﬂight speed\ncan be\ngreater\nFlight speed\nalways less than\nexhaust velocity\nFlight speed always\nless than exhaust\nvelocity\nAltitude limitation\nNone; suited to\nspace travel\n14,000–17,000 m\n20,000 m at Mach 3\n30,000 m at Mach 5\n45,000 m at Mach 12\nSpeciﬁc impulse, typicalc\n(thrust force per unit\npropellant or fuel weight\nﬂow per second)\n270 sec\n1600 sec\n1400 sec\naMultiply by 0.102 to convert to kg/(hr-N).\nbMultiply by 47.9 to convert to N/m2\ncSpeciﬁc impulse is a performance parameter and is deﬁned in Chapter 2.\nAt supersonic ﬂight speeds above Mach 2, the ramjet engine (a pure duct\nengine) becomes attractive for ﬂight within the atmosphere. Thrust is produced\nby increasing the momentum of the air as it passes through the ramjet, basically as\nis accomplished in the turbojet and turbofan engines but without compressors or\nturbines. Figure 1–2 shows the basic components of one type of ramjet. Ramjets\nwith subsonic combustion and hydrocarbon fuel have an upper speed limit of\napproximately Mach 5; hydrogen fuel, with hydrogen cooling, raises this to at\nleast Mach 16. Ramjets with supersonic combustion are known as scramjets and\nhave ﬂown in experimental vehicles. All ramjets depend on rocket boosters or\nsome other method (such as being launched from an aircraft) for being accelerated"}, {"chapter": "Chapter 1", "page": 4, "body": "\nFuel Injection\nCompressor\nsection\nCombustion\nsection\nTurbine\nsection\nAfterburner\nand nozzle \nsection\nShaft\nFIGURE 1–1. Simpliﬁed schematic diagram of a turbojet engine.\nFIGURE 1–2. Simpliﬁed diagram of a ramjet with a supersonic inlet (converging and\ndiverging ﬂow passage).\nto near their design ﬂight speed to become functional. The primary applications of\nramjets with subsonic combustion have been in shipboard and ground-launched\nantiaircraft missiles. Studies of a hydrogen-fueled ramjet for hypersonic aircraft\nlook promising. The supersonic ﬂight vehicle is a combination of a ramjet-driven\nhigh-speed airplane and a one- or two-stage rocket booster. It can travel at speeds\nup to a Mach number of 25 at altitudes of up to 50,000 m.\n1.2. ROCKET PROPULSION\nRocket propulsion systems can be classiﬁed according to the type of energy\nsource (chemical, nuclear, or solar), the basic function (booster stage, sustainer\nor upper stages, attitude control, orbit station keeping, etc.), the type of vehicle\n(aircraft, missile, assisted takeoff, space vehicle, etc.), size, type of propellant,\ntype of construction, or number of rocket propulsion units used in a given vehicle.\nAnother way is to classify by the method of producing thrust. A thermody-\nnamic expansion of a gas is used in the majority of practical rocket propulsion\nconcepts. The internal energy of the gas is converted into the kinetic energy of\nthe exhaust ﬂow and the thrust is produced by the gas pressure on the surfaces\nexposed to the gas, as will be explained later. This same thermodynamic the-\nory and the same generic equipment (nozzle) is used for jet propulsion, rocket\npropulsion, nuclear propulsion, laser propulsion, solar-thermal propulsion, and\nsome types of electrical propulsion. Totally different methods of producing thrust"}, {"chapter": "Chapter 1", "page": 5, "body": "\nare used in other types of electric propulsion or by using a pendulum in a gravity\ngradient. As described below, these electric systems use magnetic and/or electric\nﬁelds to accelerate electrically charged molecules or atoms at very low densities.\nIt is also possible to obtain a very small acceleration by taking advantage of the\ndifference in gravitational attraction as a function of altitude, but this method is\nnot explained in this book.\nThe Chinese developed and used solid propellant in rocket missiles over 800\nyears ago, and military bombardment rockets were used frequently in the eigh-\nteenth and nineteenth centuries. However, the signiﬁcant developments of rocket\npropulsion took place in the twentieth century. Early pioneers included the Rus-\nsian Konstantin E. Ziolkowsky, who is credited with the fundamental rocket\nﬂight equation and his 1903 proposals to build rocket vehicles. The German\nHermann Oberth developed a more detailed mathematical theory; he proposed\nmultistage vehicles for space ﬂight and fuel-cooled thrust chambers. The Amer-\nican Robert H. Goddard is credited with the ﬁrst ﬂight using a liquid propellant\nrocket engine in 1926. An early book on the subject was written by the Viennese\nengineer Eugen S¨anger. For rocket history see Refs. 1–1 to 1–8.\nChemical Rocket Propulsion\nThe energy from a high-pressure combustion reaction of propellant chemicals,\nusually a fuel and an oxidizing chemical, permits the heating of reaction product\ngases to very high temperatures (2500 to 4100◦C or 4500 to 7400◦F). These\ngases subsequently are expanded in a nozzle and accelerated to high velocities\n(1800 to 4300 m/sec or 5900 to 14,100 ft/sec). Since these gas temperatures are\nabout twice the melting point of steel, it is necessary to cool or insulate all the\nsurfaces that are exposed to the hot gases. According to the physical state of\nthe propellant, there are several different classes of chemical rocket propulsion\ndevices.\nLiquid propellant rocket engines use liquid propellants that are fed under pres-\nsure from tanks into a thrust chamber.∗ A typical pressure-fed liquid propellant\nrocket engine system is schematically shown in Fig. 1–3. The liquid bipropellant\nconsists of a liquid oxidizer (e.g., liquid oxygen) and a liquid fuel (e.g., kerosene).\nA monopropellant is a single liquid that contains both oxidizing and fuel species;\nit decomposes into hot gas when properly catalyzed. A large turbopump-fed liq-\nuid propellant rocket engine is shown in Fig. 1–4. Gas pressure feed systems are\nused mostly on low thrust, low total energy propulsion systems, such as those\nused for attitude control of ﬂying vehicles, often with more than one thrust cham-\nber per engine. Pump-fed liquid rocket systems are used typically in applications\nwith larger amounts of propellants and higher thrusts, such as in space launch\nvehicles. See Refs. 1–1 to 1–6.\n∗The term thrust chamber, used for the assembly of the injector, nozzle, and chamber, is preferred\nby several ofﬁcial agencies and therefore has been used in this book. For small spacecraft control\nrockets the term thruster (a small thrust chamber) is commonly used, and this term will be used in\nsome sections of this book."}, {"chapter": "Chapter 1", "page": 6, "body": "\nFIGURE 1–3. Schematic ﬂow diagram of a liquid propellant rocket engine with a gas\npressure feed system. The dashed lines show a second thrust chamber, but some engines\nhave more than a dozen thrust chambers supplied by the same feed system. Also shown\nare components needed for start and stop, controlling tank pressure, ﬁlling propellants\nand pressurizing gas, draining or ﬂushing out remaining propellants, tank pressure relief\nor venting, and several sensors.\nIn the thrust chamber the propellants react to form hot gases, which in turn are\naccelerated and ejected at a high velocity through a supersonic nozzle, thereby\nimparting momentum to the vehicle. A nozzle has a converging section, a con-\nstriction or throat, and a conical or bell-shaped diverging section as further\ndescribed in the next two chapters.\nSome liquid rocket engines permit repetitive operation and can be started and\nshut off at will. If the thrust chamber is provided with adequate cooling capacity,\nit is possible to run liquid rockets for periods exceeding 1 hour, dependent only on"}, {"chapter": "Chapter 1", "page": 7, "body": "\nFIGURE 1–4. Simpliﬁed schematic diagram of one type of liquid propellant rocket\nengine with a turbopump feed system and a separate gas generator, which generates\n“warm” gas for driving the turbine. Not shown are components necessary for controlling\nthe operation, ﬁlling, venting, draining, or ﬂushing out propellants, ﬁlters or sensors. This\nturbopump assembly consists of two propellant pumps, a gear case, and a high speed\nturbine.\nthe propellant supply. A liquid rocket propulsion system requires several precision\nvalves and a complex feed mechanism which includes propellant pumps, turbines,\nor a propellant-pressurizing device, and a relatively intricate combustion or thrust\nchamber.\nIn solid propellant rocket motors∗ the propellant to be burned is contained\nwithin the combustion chamber or case (see Fig. 1–5). The solid propellant\n∗Historically, the word engine is used for a liquid propellant rocket propulsion system and the word\nmotor is used for solid propellant rocket propulsion. They were developed originally by different\ngroups."}, {"chapter": "Chapter 1", "page": 8, "body": "\nFIGURE 1–5. Simpliﬁed perspective three-quarter section of a typical solid propellant\nrocket motor with the propellant grain bonded to the case and the insulation layer and\nwith a conical exhaust nozzle. The cylindrical case with its forward and aft hemispherical\ndomes form a pressure vessel to contain the combustion chamber pressure. Adapted with\npermission from Ref. 12–1.\ncharge is called the grain and it contains all the chemical elements for complete\nburning. Once ignited, it usually burns smoothly at a predetermined rate on all the\nexposed internal surfaces of the grain. Initial burning takes place at the internal\nsurfaces of the cylinder perforation and the four slots. The internal cavity grows\nas propellant is burned and consumed. The resulting hot gas ﬂows through the\nsupersonic nozzle to impart thrust. Once ignited, the motor combustion proceeds\nin an orderly manner until essentially all the propellant has been consumed. There\nare no feed systems or valves. See Refs. 1–7 to 1–10.\nLiquid and solid propellants, and the propulsion systems that use them, are dis-\ncussed in Chapters 6 to 11 and 12 to 15, respectively. Liquid and solid propellant\nrocket propulsion systems are compared in Chapter 19.\nGaseous propellant rocket engines use a stored high-pressure gas, such as air,\nnitrogen, or helium, as their working ﬂuid or propellant. The stored gas requires\nrelatively heavy tanks. These cold gas engines have been used on many early\nspace vehicles for low thrust maneuvers and for attitude control systems and\nsome are still used today. Heating the gas by electrical energy or by combus-\ntion of certain monopropellants improves the performance and this has often\nbeen called warm gas propellant rocket propulsion. Chapter 7 discusses gaseous\npropellants.\nHybrid propellant rocket propulsion systems use both a liquid and a solid\npropellant. For example, if a liquid oxidizing agent is injected into a combus-\ntion chamber ﬁlled with a solid carbonaceous fuel grain, the chemical reaction\nproduces hot combustion gases (see Fig. 1–6). They are described further in\nChapter 16. Several have ﬂown successfully."}, {"chapter": "Chapter 1", "page": 9, "body": "\nFIGURE 1–6. Simpliﬁed schematic diagram of a typical hybrid rocket engine. The\nrelative positions of the oxidizer tank, high-pressure gas tank, and the fuel chamber with\nits nozzle depend on the particular vehicle design.\nCombinations of Ducted Jet Engines and Rocket Engines\nThe Tomahawk surface-to-surface missile uses two stages of propulsion in\nsequence. The solid propellant rocket booster lifts the missile away from its\nlaunch platform and is discarded after its operation. A small turbojet engine\nsustains the low-level ﬂight at nearly constant speed toward the target.\nA ducted rocket, sometimes called an air-augmented rocket, combines the\nprinciples of rocket and ramjet engines; it gives higher performance (speciﬁc\nimpulse) than a chemical rocket engine, while operating within the earth’s atmo-\nsphere. Usually the term air-augmented rocket denotes mixing of air with the\nrocket exhaust (fuel rich for afterburning) in proportions that enable the propul-\nsion device to retain the characteristics typifying a rocket engine, for example,\nhigh static thrust and high thrust-to-weight ratio. In contrast, the ducted rocket\noften is like a ramjet in that it must be boosted to operating speed and uses the\nrocket components more as a fuel-rich gas generator (liquid or solid).\nThe principles of the rocket and ramjet can be combined. An example of\nthese two propulsion systems operating in sequence and in tandem and yet\nutilize a common combustion chamber volume as shown in Fig. 1–7. The low-\nvolume conﬁguration, known as an integral rocket–ramjet, can be attractive in\nair-launched missiles using ramjet propulsion. The transition from the rocket\nto the ramjet requires enlarging the exhaust nozzle throat (usually by ejecting\nrocket nozzle parts), opening the ramjet air inlet–combustion chamber interface,\nand following these two events with the normal ramjet starting sequence.\nA solid fuel ramjet uses a grain of solid fuel that gasiﬁes or ablates and\nreacts with air. Good combustion efﬁciencies have been achieved with a patented\nboron-containing solid fuel fabricated into a grain similar to a solid propellant\nand burning in a manner similar to a hybrid rocket propulsion system."}, {"chapter": "Chapter 1", "page": 10, "body": "\nFIGURE 1–7. Elements of an air-launched missile with integral rocket–ramjet propul-\nsion. After the solid propellant has been consumed in boosting the vehicle to ﬂight speed,\nthe rocket combustion chamber becomes the ramjet combustion chamber with air burning\nthe ramjet liquid fuel.\nNuclear Rocket Engines\nTwo different types of nuclear energy sources have been investigated for deliv-\nering heat to a working ﬂuid, usually liquid hydrogen, which subsequently can\nbe expanded in a nozzle and thus accelerated to high ejection velocities (6000\nto 11,000 m/sec). However, none can be considered fully developed today and\nnone have ﬂown. They are the ﬁssion reactor and the fusion reactor. Both are\nbasically extensions of liquid propellant rocket engines. The heating of the gas is\naccomplished by energy derived from transformations within the nuclei of atoms.\nIn chemical rockets the energy is obtained from within the propellants, but in\nnuclear rockets the power source is usually separate from the propellant.\nIn the nuclear ﬁssion reactor rocket, heat can be generated by the ﬁssion of\nuranium in the solid reactor material and subsequently transferred to the work-\ning ﬂuid (see Refs. 1–11 to 1–13). The nuclear ﬁssion rocket is primarily a\nhigh-thrust engine (above 40,000 N) with speciﬁc impulse values up to 900 sec.\nFission rockets were designed and tested in the 1960s in the United States and\nalso in the Soviet Union, which today is Russia. Ground tests with hydrogen\nas a working ﬂuid culminated in a thrust of 980,000 N (210,000 lb force) at a\ngraphite core nuclear reactor power level of 4100 MW with an equivalent altitude-\nspeciﬁc impulse of 848 sec and a hydrogen temperature of about 2500 K. There\nwere concerns with the endurance of the materials at the high temperature (above\n2600 K) and intense radiations, power level control, cooling a reactor after oper-\nation, moderating the high-energy neutrons, and designing lightweight radiation\nshields for a manned space vehicle. No further ground tests of nuclear ﬁssion\nrocket engines have been undertaken.\nIn recent years there has been renewed interest in nuclear ﬁssion rocket propul-\nsion primarily for a potential manned planetary exploration mission. Studies\nhave shown that the high speciﬁc impulse (estimated in some studies at 1100\nsec) allows shorter interplanetary trip transfer times, smaller vehicles, and more\nﬂexibility in the launch time when planets are not in their optimum relative\nposition. See Refs. 1–11 and 1–13."}, {"chapter": "Chapter 1", "page": 11, "body": "\nFusion is an alternate way to create nuclear energy, which can heat a working\nﬂuid. A number of different concepts have been studied. To date none are feasible\nor practical.\nConcerns about an accident with the inadvertent spreading of radioactive mate-\nrials in the earth environment and the high cost of development programs have\nto date prevented a renewed experimental development of a large nuclear rocket\nengine. Unless there are some new ﬁndings and a change in world attitude about\nnuclear radiation, it is unlikely that a nuclear rocket engine will be developed or\nﬂown in the next few decades. Therefore no further discussion of it is given in\nthis book.\nElectric Rocket Propulsion\nIn all electric propulsion the source of the electric power (nuclear, solar radiation\nreceivers, or batteries) is physically separate from the mechanism that produces\nthe thrust. This type of propulsion requires a heavy and inefﬁcient power sources\nas discussed below. The thrust usually is low, typically 0.005 to 1 N. In order to\nallow a signiﬁcant increase in the vehicle velocity, it is necessary to apply the\nlow thrust and thus a small acceleration for a long time (weeks or months) (see\nChapter 17 and Refs. 1–14 and 1–15).\nOf the three basic types, electrothermal rocket propulsion most resembles\nthe previously mentioned chemical rocket units; propellant is heated electrically\n(by heated resistors or electric arcs), and the hot gas is then thermodynamically\nexpanded and accelerated to supersonic velocity through an exhaust nozzle (see\nFig. 1–8). These electrothermal units typically have thrust ranges of 0.01 to 0.5 N,\nwith exhaust velocities of 1000 to 5000 m/sec, and ammonium, hydrogen, nitro-\ngen, or hydrazine decomposition product gases have been used as propellants.\nThe two other types—the electrostatic or ion propulsion engine and the\nelectromagnetic or magnetoplasma engine—accomplish propulsion by differ-\nent principles, and the thermodynamic expansion of gas in a nozzle, as such,\ndoes not apply. Both will work only in a vacuum. In an ion rocket (see Fig. 1–9)\na working ﬂuid (typically, xenon) is ionized (by stripping off electrons), and then\nthe electrically charged heavy ions are accelerated to very high velocities (2000\nto 60,000 m/sec) by means of electrostatic ﬁelds. The ions are subsequently elec-\ntrically neutralized; they are combined with electrons to prevent the buildup of\na space charge on the vehicle.\nIn the magnetoplasma rocket an electrical plasma (an energized hot gas con-\ntaining ions, electrons, and neutral particles) is accelerated by the interaction\nbetween electric currents and magnetic ﬁelds and ejected at high velocity (1000\nto 50,000 m/sec). There are many different types and geometries. The Hall-effect\nthruster, which accelerates a plasma, has a good ﬂight record in Russia. A simple\npulsed (not continuously operating) electrical propulsion unit with a solid pro-\npellant is shown in Fig. 1–10. It has had a good ﬂight record as a spacecraft\nattitude control engine."}, {"chapter": "Chapter 1", "page": 12, "body": "\nFIGURE 1–8. Simpliﬁed schematic diagram of arc-heating electric rocket propulsion\nsystem. The arc plasma temperature is very high (perhaps 15,000 K) and the anode,\ncathode, and chamber will get hot (1000 K) due to heat transfer.\nFIGURE 1–9. Simpliﬁed schematic diagram of a typical ion rocket, showing the approx-\nimate distribution of the electric power.\nOther Rocket Propulsion Concepts\nSeveral technologies exist for harnessing solar energy to provide the power for\nspacecraft and also to propel spacecraft using electrical propulsion. Solar cells\ngenerate electric power from the sun’s radiation. They are well developed and\nhave been successful for several decades. Most electric propulsion systems have\nused solar cells for their power supply. Batteries and isotope decay power sources\nhave also been used.\nOne concept is the solar thermal rocket; it has large-diameter optics to concen-\ntrate the sun’s radiation (e.g., by lightweight precise parabolic mirrors or Fresnel\nlenses) onto a receiver or optical cavity. Figure 1–11 shows one concept and\nsome data is given in Table 2–1. The receiver is made of high-temperature metal\n(such as tungsten or rhenium) and has a cooling jacket or heat exchanger. It\nheats a working ﬂuid, usually liquid hydrogen, up to perhaps 2500◦C and the hot\ngas is controlled by hot gas valves and exhausted through one or more nozzles.\nThe large mirror has to be pointed toward the sun, and this usually requires the\nmirror to be adjustable in its orientation as the spacecraft orbits around the earth."}, {"chapter": "Chapter 1", "page": 13, "body": "\nFIGURE 1–10. Simpliﬁed diagram of a rail accelerator for self-induced magnetic accel-\neration of a current-carrying plasma. When the capacitor is discharged, an arc is struck at\nthe left side of the rails. The high current in the plasma arc induces a magnetic ﬁeld. The\naction of the current and the magnetic ﬁeld causes the plasma to be accelerated at right\nangles to both the magnetic ﬁeld and the current, namely in the direction of the rails.\nEach time the arc is created a small amount of solid propellant (Teﬂon) is vaporized and\nconverted to a small plasma cloud, which (when ejected) gives a small pulse of thrust.\nActual units can operate with many pulses per second.\nFIGURE 1–11. Simpliﬁed schematic diagram of a solar thermal rocket concept.\nPerformance can be two to three times higher than that of a chemical rocket and\nthrust levels in most studies are low (1 to 10 N). Since large lightweight optical\nelements cannot withstand drag forces without deformation, the optical systems\nare deployed outside the atmosphere. Contamination is negigible, but storage or\nrefueling of liquid hydrogen is a challenge. Problems being investigated include"}, {"chapter": "Chapter 1", "page": 14, "body": "\nrigid, lightweight mirror or lens structures, operational life, minimizing hydrogen\nevaporation, and heat losses to other spacecraft components. To date the solar\nthermal rocket has not yet provided the principal thrust of a ﬂying spacecraft.\nThe solar sail is another concept. It is basically a big photon reﬂector surface.\nThe power source for the solar sail is the sun and it is external to the vehicle\n(see Ref. 1–16). Approaches using nuclear explosions and pulsed nuclear fusion\nhave been analyzed (Refs. 1–17 and 1–18) but are not yet feasible. Concepts\nfor transmitting radiation energy (by lasers or microwaves) from ground stations\non Earth to satellites have been proposed but are not yet developed.\nInternational Rocket Propulsion Effort\nActive development or production of rocket propulsion systems was or is under\nway in more than 30 different countries. Some of them have made signiﬁcant\nand original contributions to the state of the art of the technologies. There is\nmention in this book of a few foreign rocket units and their accomplishments\nand references to international rocket literature. Although most of the data in\nthis book are taken from U.S. rocket experience, this is not intended to minimize\nforeign achievements.\nAt the time of this writing the major international program has been the\nInternational Space Station (ISS), a multiyear cooperative effort with major con-\ntributions from the United States and Russia and active participation by several\nother nations. This manned orbital space station is used for conducting experi-\nments and observations on a number of research projects. See Ref. 1–19.\n1.3. APPLICATIONS OF ROCKET PROPULSION\nBecause the rocket can reach a performance unequaled by other prime movers,\nit has its own ﬁelds of application and does not usually compete with other\npropulsion devices. Examples of important applications are given below and\ndiscussed further in Chapter 4.\nSpace Launch Vehicles\nBetween the ﬁrst space launch in 1957 and the end of 1998 approximately 4102\nspace launch attempts have taken place in the world and all but about 129 were\nsuccessful (see Ref. 1–20). Space launch vehicles or space boosters can be clas-\nsiﬁed broadly as expendable or recoverable/reusable. Other bases of classiﬁcation\nare the type of propellant (storable or cryogenic liquid or solid propellants), num-\nber of stages (single-stage, two-stage, etc.), size/mass of payloads or vehicles,\nand manned or unmanned.\nEach space launch has a speciﬁc space ﬂight objective, such as an earth orbit\nor a moon landing. See Ref. 1–21. It uses between two and ﬁve stages, each\nwith its own propulsion systems, and each is usually ﬁred sequentially after the"}, {"chapter": "Chapter 1", "page": 15, "body": "\nlower stage is expended. The number of stages depends on the speciﬁc space\ntrajectory, the number and types of maneuvers, the energy content of a unit mass\nof the propellant, payload size, and other factors. The initial stage, usually called\nthe booster stage, is the largest and it is operated ﬁrst; this stage is then separated\nfrom the ascending vehicle before the second-stage rocket propulsion system is\nignited and operated. As will be explained in Chapter 4, adding an extra stage\npermits a signiﬁcant increase in the payload (such as more scientiﬁc instruments\nor more communications gear).\nEach stage of a multistage launch vehicle is essentially a complete vehicle in\nitself and carries its own propellant, its own rocket propulsion system or systems,\nand its own control system. Once the propellant of a given stage is expended, the\nremaining mass of that stage (including empty tanks, cases, structure, instruments,\netc.) is no longer useful in providing additional kinetic energy to the succeeding\nstages. By dropping off this useless mass it is possible to accelerate the ﬁnal\nstage with its useful payload to a higher terminal velocity than would be attained\nif multiple staging were not used. Both solid propellant and liquid propellant\nrocket propulsion systems have been used for low earth orbits.\nFigure 1–12 shows the Delta IV heavy-lift space launch vehicle at takeoff.\nIts propellants are liquid oxygen/liquid hydrogen (LOX/LH2) in all its main\nengines. Its booster engine, the Pratt & Whitney Rocketdyne RS-68, is shown\nin Fig. 6–10 and data is in Table 11–2 and its second-stage engine, the Pratt\n& Whitney Rocketdyne RL 10B-2 LOX/LH2 (24,750 lb thrust) is shown in Fig.\n8–17 and data is in Table 8–1. The two liquid propellant strap-on booster pods\n(with the same booster engine) are removed for smaller payloads. Figure 1–13\nshows the Atlas V space launch vehicle. Its booster engine is the Energomash\nRD-180, it has Aerojet solid propellant strap-on boosters, and the upper stage\nengine is the Pratt & Whitney Rocketdyne RL 10A-4-2 LOX/LH2 engine. The\nRussian (Energomash) LOX/kerosene RD-180 engine is shown in Ref. 1–2 as its\nFigure 7.10-11 and data is in its Table 7.10-2. In both of these two launch vehicles\nthe payload is carried on top of the second stage and it has its own propulsion\nsystem of small thrusters. Table 1–3 gives data of the larger propulsion systems\nof these two U.S. launch vehicles.\nThe U.S. Space Shuttle is one of the older programs and it provided the\nﬁrst reusable spacecraft that lands on a runway. Figure 1–14 shows the basic\nconﬁguration of the Space Shuttle, which consists of two stages, the booster and\nthe orbiter. It shows all the 67 rocket propulsion systems of the shuttle. The\norbiter is really a reusable combination space launch vehicle, spacecraft, and\nglider for landing. The two solid propellant strap-on rocket motors are the largest\nin existence; they are equipped with parachutes for sea recovery of the burned-out\nmotors. The large LO2/LH2 external tank is jettisoned and expended just before\norbit insertion (see Ref. 1–22). Details of several of these Space Shuttle rocket\npropulsion systems are given in Table 1–4. The Space Shuttle accomplishes both\ncivilian and military missions of placing satellites in orbit, undertaking scientiﬁc\nexploration, supplying a space station, and repairing, servicing, and retrieving\nsatellites."}, {"chapter": "Chapter 1", "page": 16, "body": "\nFIGURE 1–12. Heavy lift Delta IV space launch vehicle. The center liquid propellant\nbooster stage has a Pratt & Whitney Rocketdyne RS-68 rocket engine (LOX/LH2). The\ntwo strap-on stages each use the same engine. (Courtesy Pratt & Whitney Rocketdyne)"}, {"chapter": "Chapter 1", "page": 17, "body": "\nFIGURE 1–13. Atlas V space launch vehicle with three (or ﬁve) strap-on stages using\nAerojet solid rocket motors and a central Energomash (Russia) RD-180 liquid propellant\nbooster rocket engine running on LOX/kerosene. (Courtesy Lockheed Martin Corp.)"}, {"chapter": "Chapter 1", "page": 18, "body": "TABLE 1–3. Propulsion System Data for Two Major U.S. Lauch Vehicles\nNo. of\nMixture Ratio,\nDesignation\nPropulsion\nSpeciﬁc\nOxidizer\nChamber\nNozzle\nInert\nPropulsion\nSystems\nThrust lbf/kN\nImpulse\nto Fuel\nPressure\nExit Area\nPropulsion\nVehicle\nSystem\nStage\nper Stage\nper Engine/Motor\n(sec)\nFlow\npsia\nRatio\nMass klb/kg\nDELTA IV\nRS-68\n1\n1 or 3\nFull power\n750,000/3.341 (vac)\n655,000/2.91 (SL)c\n409 (vac)a\n364 (SL)b\n6.0\n1410\n21.5:1\n14,200/6,455\nMinimum power\n432,000/1.92 (vac)\n337,000/1.059 (SL)c\nRL 10B-2\n2\n1\n24,750/0.110\n465.5 (vac)a\n5.88\n633\n285:1\n664\nATLAS V\nBooster\n0\nBetween 1 287,346/1.878 each\n(SL)\n279.3 (SL)b\nN/A\nNA\n16:1c\n102.8 klbf loaded\npropellant\nand 5\nRD-180d\n1\n1\n933,400/4.151 kN (vac) 310.7 (SL)b\n2.72\n3722\n36.4:1\n12,081 lb/5,480 kg\n5330 kg\n860,200/3.820 (SL)c\n337.6 (vac)a\nRD 10A-4-2\n2\n1 or 2\n22,300/0.099\n450.5\n4.9–5.8\n610\n84:1\n175 kg/367 lb\na(vac) means vacuum.\nb(SL) means sea level.\ncAt ignition.\ndRD-180 has 2 gimbal mounted thrust chambers.\n18"}, {"chapter": "Chapter 1", "page": 19, "body": "FIGURE 1–14. Simpliﬁed sketch of original version of Space Shuttle vehicle. The shuttle orbiter—the delta-winged vehicle about the size of\na medium-range jet liner—is a reusable, cargo carrying, spacecraft–airplane combination that takes off vertically and lands horizontally like a\nglider. Each shuttle orbiter was designed for a minimum of 100 missions and can carry as much as 65,000 lb of payload to a low Earth orbit,\nand a crew of up to four members and 10 passengers. It can return up to 25,000 lb of payload back to earth.\n19"}, {"chapter": "Chapter 1", "page": 20, "body": "TABLE 1–4. Propulsion Systems for the Space Shuttle\nNumber of\nPropulsion\nStarts and\nPropellant\nSystem\nTypical\nand Speciﬁc\nVehicle Section\n(No. of Units)\nBurn Time\nImpulse (I s)\nThrust\nMission\nShuttle orbiter\nSpace Shuttle Main Engine\n(3)\nStart at launch 8.4 min\nduration\nLiquid hydrogen–\nliquid oxygen\n1670 kN each (375,000 lb)\nat sea level\nLift orbiter off ground and\naccelerate to orbit velocity.\nLife: 55 starts and\n7.5 hr\n4464 N-sec/kg\n(455 sec)\n2100 kN each (470,000\nlbf) at space vacuum\nIndividual engines can be shut\ndown to reduce thrust level.\nThrottled 109 to 65% of\nrated power\nOrbital maneuver systems\n(2)\n3 to 10 starts/mission;\ndesigned for 1000 starts,\n100 ﬂights, 15 hr of\ncumulative time\nSee Note 1;\nI s = 313 sec\nTwo orbiter maneuver,\nengines; 27 kN each\n(6000 lbf) in vacuum\nInsert orbiter vehicle into\nEarth orbit, correct orbit,\nabort, and deorbit maneuver.\nReaction control system,\n38 primary thrusters, 6\nvernier thrusters\nMultiple operations;\nthousands of starts;\nduration from a few\nmilliseconds to seconds\nSee Note 1;\nI s = 280 − 304 sec,\ndepending on nozzle\nPrimary thruster 3870 N\neach (870 lbf), vernier\nthruster 106.8 N each\n(25 lbf)\nSmall vehicle velocity\nadjustments and attitude\ncontrol during orbit\ninsertion, on orbit\ncorrections, rendezvous,\nand reentry.\nSolid rocket boosters\n(SRBs) original\nversion\nAttached to external tank;\nmultisection, 2 units\nSingle start at launch\n2 min\nSee Note 2;\nI s = 292 sec\n14,700 kN each, or\n3.3 × 106 lbf each\nBoost Shuttle vehicle to about\n5500 km/hr\nSeparation rocket motors;\n16 units\n4 each at forward frustum\nand aft skirt; 0.66 sec,\nnominal\nSolid propellant;\nI s = 250 sec\n97,840 N each or 22,000\nlbf\nMove SRB away from vehicle\nafter cut-off\nNotes:\n1. MMH, monomethylhydrazine and NTO, nitrogen tetroxide.\n2. 70% Ammonium perchlorate; 16% aluminum; 12% polybutadiene acrylic acid binder; 2% epoxy curing agent.\n20"}, {"chapter": "Chapter 1", "page": 21, "body": "\nTable 1–4 gives propulsion system data on the Space Shuttle, which is really\na combination of launch vehicle, spacecraft, and a glider. It can be seen that\nthe thrust levels are highest for booster or ﬁrst stages and are relatively high for\nupper stages (thousands of pounds). Only for the attitude control system of the\nvehicle (also called reaction control in Table 1–4) are the thrust levels low (from\na fraction of a pound for small spacecraft to as high as about 1000 pounds thrust\nin the Space Shuttle vehicle). Frequent propulsion starts and stops are usually\nrequired in these applications.\nAt the time of this writing (early 2008) for this new 8th edition National\nAeronautics and Space Administration (NASA) had awarded the initial contracts\nfor a new large manned space ﬂight vehicle identiﬁed as Ares I. It is intended\nto replace the aging Space Shuttle after about 2012. It is planned to use a large\nsingle 5-segment solid rocket motor as booster propulsion (being developed by\nATK Launch Systems) and the second stage will use a J-2X liquid propellant\nrocket engine with LOX/LH2 propellants (being developed by Pratt & Whitney\nRocketdyne).\nA new set of manned space ﬂight vehicles are currently being developed by\nseveral entrepreneurial US and foreign companies, many with their own private\ncapital. They are aimed at the future commercial market of sending tourists\n(for a hefty price) into space and returning them safely back to earth. All are\nbased on reusable spacecraft, some with reusable launch vehicles, some with\nvertical and some with horizontal takeoff or landing. A couple of suborbital ﬂights\nhave already been accomplished with professional pilots using a winged vehicle.\nLiquid propellant rocket engines seem to be preferred and many are planned to\nbe reusable. It is too early for determining which of these organizations will be\nsuccessful in commercializing manned space ﬂight.\nThe missions and payloads for space launch vehicles are many, such as\nmilitary (reconnaissance satellites, command and control satellites), nonmili-\ntary government [weather observation satellites, global positioning system (GPS)\nsatellites], space exploration (space environment, planetary missions), or com-\nmercial (communication satellites).\nA single stage-to-orbit vehicle, attractive because it avoids the costs and com-\nplexities of staging, has been expected to have improved reliability (simpler\nstructures, fewer components). However, its payload is usually too small. A low\nearth orbit (say 100 miles altitude) can only be achieved with such a vehicle\nif the propellant performance is very high and the structure is efﬁcient and low\nin mass. Liquid propellants such as liquid hydrogen with liquid oxygen were\nusually chosen. To date a large rocket-propelled single stage-to-orbit vehicle has\nnot ﬂown.\nSpacecraft\nDepending on their missions, spacecraft can be categorized as earth satellites,\nlunar, interplanetary, and trans-solar types, and as manned and unmanned\nspacecraft. Reference 1–23 lists over 20,000 satellites and categorizes them as\nsatellites for communications, weather, navigation, scientiﬁc exploration, deep"}, {"chapter": "Chapter 1", "page": 22, "body": "\nspace probes, observation (including radar surveillance), reconnaissance and\nother applications. Rocket propulsion is used for both primary propulsion (i.e.,\nacceleration along the ﬂight path, such as for orbit insertion or orbit change\nmaneuvers) and secondary propulsion functions in these vehicles. Some of the\nsecondary propulsion functions are attitude control, spin control, momentum\nwheel and gyro unloading, stage separation, and the settling of liquids in tanks.\nA spacecraft usually has a series of different rocket propulsion systems, some\noften very small. For spacecraft attitude control about three perpendicular axes,\neach in two rotational directions, the system must allow the application of pure\ntorque for six modes of angular freedom, thus requiring a minimum of 12\nthrusters. Some missions require as few as 4 to 6 thrusters, whereas the more\ncomplex manned spacecraft have 40 to 80 thrusters in all of its stages. Often\nthe small attitude control rockets must give pulses or short bursts of thrust,\nnecessitating thousands of restarts. See Section 6.7 and Ref. 1–24.\nTable 1–5 presents a variety of spacecraft along with their weights, missions,\nand propulsion. Although only U.S. launch vehicles are listed in this table, there\nare also launch vehicles developed by France, the European Space Agency, Rus-\nsia, Japan, China, India, and Israel that have successfully launched payloads into\nsatellite orbits. They use rocket propulsion systems that were developed in their\nown countries.\nThe majority of spacecraft have used liquid propellant engines, a few with solid\npropellant boosters. Many spacecraft have operated successfully with electrical\npropulsion for attitude control. Electrical propulsion systems will probably also\nbe used for some primary and secondary spacecraft propulsion missions on long-\nduration space ﬂights, as described in Chapter 17.\nMicropropulsion is a relatively new designation. It has been deﬁned as any\nrocket propulsion system that is applicable to small spacecraft with a mass of\nless than 100 kg, or 220 lb. See Ref. 1–25. It encompasses a variety of different\npropulsion concepts, such as certain very low thrust liquid mono- and bipropellant\nrocket engines, small gaseous propellant rocket engines, several types of electrical\npropulsion systems, and emerging advanced versions of these. Many are based\non fabrication of very small components (valves, thrusters, switches, insulators,\nor sensors) by micromachining and electromechanical processes.\nMissiles and Other Applications\nMilitary missiles can be classiﬁed as shown in Table 1–6. Rocket propulsion for\nnew U.S. missiles uses now almost exclusively solid propellant rocket motors.\nThey can be strategic missiles, such as long-range ballistic missiles (800 to\n9000 km range), which are aimed at military targets within an enemy country, or\ntactical missiles, which are intended to support or defend military ground forces,\naircraft, or navy ships.\nTables 1–6 and 1–7 show some parameters of rocket propulsion devices\nfor different applications. The selection of the best rocket propulsion system\ntype and design for any given application is a complex process involving many\nfactors, including system performance, reliability, propulsion system size, and\ncompatibility, as described in Chapter 19."}, {"chapter": "Chapter 1", "page": 23, "body": "TABLE 1–5. Selected U.S. Spacecraft\nSpace Maneuver Propulsion\nName\nThrust (lbf)\nPropellants\nWeight (lbf)\nRemarks\nMariner 69\n50 (primary)\nHydrazine monopropellant\n1, 100\nFlyby of Venus/Mercury\n1.0 (secondary)\nHydrazine monopropellant\nPioneer 10, 11\n50 (primary)\nHydrazine monopropellant\n570\nFly to Jupiter and beyond\nViking\n600 (primary)\nHydrazine monopropellant\n7, 500\nMars orbiter with soft lander\n5.0 (secondary)\nHydrazine monopropellant\nNimbus 5\n0.5 (secondary)\nStored nitrogen\n1, 700\nWeather satellite\nApollo command and\nservice module\n20,500 (primary)\nN2O4/50% and 50% UDMH\nand 50% N2H4\n64, 500\nManned lunar landing\n100 lbf 16 units\naN2O4/MMH\n93 lbf 6 units (secondary)\nN2O4/MMH\nSpace Shuttle orbiter\nTwo 6000-lbf units (primary)\nN2O4/MMH\n150, 000\nReusable spacecraft with\nrunway landing\n38 units @ 870 lbf (secondary)\nN2O4/MMH\nSix 25-lbf units (secondary)\nN2O4/MMH\nFleet Communications\nSatellite\n0.1 (secondary)\nHydrazine monopropellant\n1, 854\nUHF communications\nPhoto Recon\n4.0 (secondary)\nHydrazine monopropellant\n25, 000\nRadio/photo communications\nIntelsat V communication\nsatellite\n0.10\nHydrazine\n4, 180\nResistojet, electric propulsion\nfor N–S station keeping\nDeep Space 1 (DS1)\n0.02 (primary)\nXenon\n1, 070\nIon propulsion engine for\nasteroid ﬂy-by\naN2O4, nitrogen tetroxide (oxidizer); MMH, monomethylhydrazine (fuel); 50:50 UDMH–N2H4 is a 50% mixture of unsymmetrical dimethylhydrazine and\nhydrazine.\n23"}, {"chapter": "Chapter 1", "page": 24, "body": "TABLE 1–6. Selected Data for U.S. Missiles\nMission Category\nName\nDiameter (ft)\nLength (ft)\nPropulsion\nLaunch Weight (lb)\nSurface-to-surface (long range)\nMinuteman III\n6.2\n59.8\n3 stages, solid\n78,000\nPoseidon\n6.2\n34\n2 stages, solid\n65,000\nSurface-to-air (or to missile)\nChaparral\n0.42\n9.5\n1 stage, solid\n185\nImproved Hawk\n1.2\n16.5\n1 stage, solid\n1,398\nStandard Missile\n1.13\n15 or 27\n2 stages, solid\n1,350/2,996\nRedeye\n0.24\n4\n1 stage, solid\n18\nPatriot\n1.34\n1.74\n1 stage, solid\n1,850\nAir-to-surface\nMaverick\n1.00\n8.2\n1 stage, solid\n475\nShrike\n0.67\n10\n1 stage, solid\n400\nSRAM\n1.46\n14\n2 staged grains\n2,230\nAir-to-air\nFalcon\n0.6\n6.5\n1 stage, solid\n152\nPhoenix\n1.25\n13\n1 stage, solid\n980\nSidewinder\n0.42\n9.5\n1 stage, solid\n191\nSparrow\n0.67\n12\n1 stage, solid\n515\nAntisubmarine\nSubroc\n1.75\n22\n1 stage, solid\n4,000\nBattleﬁeld support\n(surface-to-surface, short\nrange)\nLance\n1.8\n20\n2 stages, liquid\n2,424\nHellﬁre (antitank)\n0.58\n5.67\n1 stage, solid\n95\nPershing II\n3.3\n34.5\n2 stages, solid\n10,000\nTow (antitank)\n0.58\n3.84\n1 stage, solid\n40\nCruise missile (subsonic)\nTomahawk\n1.74\n21\nsolid booster +\nturbofan\n3,900\n24"}, {"chapter": "Chapter 1", "page": 25, "body": "TABLE 1–7. Typical Propulsion Characteristics of Some Rocket Applications\nApplication\nType of Propellant\nThrust Proﬁle\nTypical Firing Duration\nMaximum Accelerationa\nLarge space launch vehicle\nbooster\nLiquid or cryogenic liquid,\nor solid\nNearly constant thrust\n2–8 min\n1.2–6 g0\nStrap-on booster\nSolid or liquid\n380,000 to 1,500,000 lbf\n1\n2 to 2 min\n1.2 to 3 g0\nAntiaricraft or\nantimissile-missile\nSolid, some with liquid\nterminal divert stage\nHigh thrust boost, decreasing thrust\nsustain phase\n2–75 sec each\n5 to 20 g0, but can be\nup to 100 g0\nSpacecraft orbit maneuvers\nStorable liquid or cryogenic\nliquid\nRestartable in space\nUp to 10 min\ncumulative duration\n0.2–6 g0\nAir-launched guided missile\nSolid\nHigh thrust boost phase with low\nthrust or decreasing thrust for\nsustain phase; sometimes 2 pulses\nBoost: 2–5 sec\nSustain: 10–30 sec\nUp to 25 g0\nBattleﬁeld support—surface\nlaunched\nSolid\nDecreasing thrust\nUp to 2 min each stage\nUp to 10 g0\nRocket-assisted projectile, gun\nlaunched\nSolid\nConstant or decreasing thrust\nA few sec\nUp to 20,000 g0 in gun\nbarrel\nSpacecraft attitude\ncontrol—large vehicles\nStorable liquid\n(monopropellant or\nbipropellant); electric\npropulsion; xenon\nMany restarts (up to several\nthousands); pulsing\nUp to several hours\ncumulative duratiaon\nLess than 0.1 g0\nSpacecraft attitude\ncontrol—small vehicle\nElectric propulsion; Cold or\nwarm gas or storable\nliquid.\nSame\nUp to several hours\ncumulative\nSame\nReusable main engines for\nSpace Shuttle\nCryogenic liquid (O2/H2)\nVariable thrust, many ﬂights with same\nengine\n8 min, over 7 hr\ncumulative in several\nmissions\nLunar landing\nStorable bipropellant\n10:1 thrust variation\n4 min\nSeveral g0\nWeather sounding rocket\nSolid\nSingle burn period—often decreasing\nthrust\n5–50 sec\nUp to 15 g0\nAntitank\nSolid\nSingle burn period\n0.2–3 sec\nUp to 20 g0\nag0 is acceleration of gravity at the Earth’s surface = 9.8066 m/sec2 or 32.17 ft/sec2.\n25"}]}